In [1]:
# string Formatting
s = ""
n = int(input("Enter n = "))
file = open('data.csv','a')
for i in range(n):
    name = input("Enter name = ")
    phone = int(input("Enter phone = "))
    info = f"{name} , {phone}\n"
    s = s+info
print(s)
file.write(s)
file.close()

Enter n = 3
Enter name = sangam
Enter phone = 3434
Enter name = sdfas
Enter phone = 3434
Enter name = safads
Enter phone = 343
sangam , 3434
sdfas , 3434
safads , 343

In [6]:
import pandas as pd
df = pd.read_csv('data.csv',nrows = 4)
df

   Sn    name  Age Address     Phone
0   1   Ayush   30     ktm  38473493

In [8]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df

      name  Age Address     Phone
Sn
1    Ayush   30     ktm  38473493

In [12]:
import pandas as pd
df = pd.read_csv('data.csv',index_Col = 'Sn')
df.head(3)
# df.tail(2)

TypeError: read_csv() got an unexpected keyword argument 'index_Col'

In [15]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn',usecols = ['Sn','name','Age'])
# df.head(3)
df

      name  Age
Sn
1    Ayush   30
2   sagnam   44
3    sagar   45
4    yhhaf   34

In [19]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df.iloc[1:4]

      name  Age Address     Phone
Sn
2   sagnam   44     Bkt  39483948
3    sagar   45     LTP   3434334
4    yhhaf   34     fsa   3433434

In [20]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df.iloc[1:4,0:2]

      name  Age
Sn
2   sagnam   44
3    sagar   45
4    yhhaf   34

In [22]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'name')
df.loc['sagnam':'sagar']

        Sn  Age Address     Phone
name
sagnam   2   44     Bkt  39483948
sagar    3   45     LTP   3434334

In [24]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
df[df['Age'] > 40]

       name  Age Address     Phone
Sn
2    sagnam   44     Bkt  39483948
3     sagar   45     LTP   3434334
5   fsdsadf   43     efd     43434

In [25]:
import pandas as pd
df = pd.read_csv('data.csv',index_col = 'Sn')
data = df[df['Address'] == 'Bkt']
data.to_csv('new_file.csv')

In [26]:
import pandas as pd
d = {'Name':['Akash','Sabin','Sita'],'Age':[34,56,43]}
df = pd.DataFrame(d)
df.to_csv('info.csv')
df

    Name  Age
0  Akash   34
1  Sabin   56
2   Sita   43

In [27]:
import pandas as pd
d = {'Name':['Akash','Sabin','Sita'],'Age':[34,56,43]}
df = pd.DataFrame(d)
df.to_json('info.json')
df

    Name  Age
0  Akash   34
1  Sabin   56
2   Sita   43

In [29]:
import csv
fields=['Kamal','28']
with open('info.csv', 'a') as f:
    x = csv.writer(f)
    x.writerow(fields)

In [30]:
import csv
fields=['Kamal','28']
f = open('info.csv', 'a')
x = csv.writer(f)
x.writerow(fields)
f.close()

In [31]:
import csv
data = [['Ram',67,'Kathmandu'],
        ['Shyam',34,'Patan'],
        ['Sita',23,'Bhaktapur']]

f = open('info.csv', 'w')
x = csv.writer(f)
for i in data:
    x.writerow(i)
f.close()

In [32]:
import csv
data = []
with open('info.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        data.append(dict(row))

print(data)

[{'Ram': 'Shyam', '67': '34', 'Kathmandu': 'Patan'}, {'Ram': 'Sita', '67': '23', 'Kathmandu': 'Bhaktapur'}]

In [33]:
csv_columns = ['Name', 'Age', 'Address']
dict = [
    {'Name':'Aayush','Age':23,'Address':'Katmandu'},
    {'Name':'Shyam','Age':33,'Address':'Patan'}
]

csvfile = open("data.csv", 'w')

writer = csv.DictWriter(csvfile, fieldnames=csv_columns)

writer.writeheader()

for data in dict:
    writer.writerow(data)
    
    
csvfile.close()